print('Hello World!')
x = 10
if x < 20:                   # Формування блоків - починається з ":"
    print( x )                # межі блоку задаються відступами
    print( 'is less than' )   # відступи "набираються" пробілами, бажано без \t
    print( 20 )               #
else :
    print( 'x' )
    print( 'Less than' )
    print( 20 )
x = 1j
y = 2 + 3j
print("x * y = ", x * y)

print(2 ** 128)

'''
    Потрійні лапки задають довгі (багаторядкові) літерали,
    а також вживаються для довгих коментарів
'''
# Типізація у Python динамічна, але "на запис" - під час запису значення
# його тип фіксується доки не буде змінений наступним записом
x = "12"    # зафіксовано, що х - string (до того був - complex)
# print(x + 1) # TypeError: can only concatenate str (not "int") to str
print( int(x) + 1)  # 13  -- змішування типів автоматично не вирішується
print( x + str(1))  # 121 -- потрібне явне перетворення

x = 12  # зміна типу даних - новий запис
print( x + 1 ) # 13
# print( x + str(1) ) # TypeError: unsupported operand type(s) for +: 'int' and 'str'

# Введення даних (зі стандартного потоку)
x = input( "Введіть x = " ) # з потоку виходять як str
print ("Ви ввели " + x)     # це не спричинює помилок конкатенації
x = int(x) # без цього порівняння видасть помилку
if x < 10 :
    print ("< 10")
elif x < 20 :
    print ("10..19")
elif x < 30
    print("20..29")
else :
    print (">= 30")